# Análisis exploratorio y limpieza de datos

In [1]:
import pandas as pd

## Tabla Ventas

In [16]:
dfv = pd.read_excel('./raw data/Tabla Ventas.xlsx', header=2, usecols=['NroFactura', 'FechaFactura','Cliente','MontoSinImp','Impuestos','MontoFactura'])

In [17]:
dfv

,NroFactura,FechaFactura,Cliente,MontoSinImp,Impuestos,MontoFactura
0,1,2014-01-03,Semillas Santo Mongo,765.68,203.53,969.21
1,2,2014-01-03,Buffalo Cnia,420.60,111.80,532.40
2,3,2014-01-03,Englewood Cnia,108.98,28.96,137.94
3,4,2014-01-04,"Ross, Christian",304.94,81.05,385.99
4,5,2014-01-04,"Diaz, Gabriel",107.07,28.45,135.52
...,...,...,...,...,...,...
4395,4396,2016-07-28,"Ward, Jeremy",113.00,23.73,136.73
4396,4397,2016-07-28,Coffs Harbour Cnia,409.00,85.89,494.89
4397,4398,2016-07-28,"Miller, Seth",801.00,168.21,969.21
4398,4399,2016-07-28,"Sharma, Ethan",856.00,179.76,1035.76
4399,4400,2016-07-29,"Smith, Jonathan",781.00,164.01,945.01

In [18]:
dfv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4400 entries, 0 to 4399
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   NroFactura    4400 non-null   int64
 1   FechaFactura  4400 non-null   datetime64[ns]
 2   Cliente       4400 non-null   object
 3   MontoSinImp   4400 non-null   float64
 4   Impuestos     4400 non-null   float64
 5   MontoFactura  4400 non-null   float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(1)
memory usage: 206.4+ KB

* Nulos

In [20]:
dfv.isna().sum()

NroFactura      0
FechaFactura    0
Cliente         0
MontoSinImp     0
Impuestos       0
MontoFactura    0
dtype: int64

* Duplicados

In [22]:
dfv.duplicated().sum()

0

In [24]:
dfv.duplicated(subset=['NroFactura'],keep=False).sum()

0

## Tabla Clientes

In [106]:
dfc = pd.read_csv('./raw data/Tabla Clientes.csv', sep=";" , header=2, encoding='latin',usecols=['Cliente','Tipo','Teléfono','Ubicación'])

In [107]:
dfc

,Cliente,Tipo,Teléfono,Ubicación
0,"Adams, Fernando",Persona,373846615,"Miami, Estados Unidos"
1,"Adams, Wyatt",Persona,646775929,"Madrid, España"
2,"Alonso, Julio",Persona,667028591,"Buenos Aires, Argentina"
3,"Ana, Maria",Persona,707344341,"Córdoba, Argentina"
4,"Anderson, Nicholas",Persona,743415512,"La Paz, Bolivia"
...,...,...,...,...
102,Wapato Cnia,Empresa,501853861,"Santa Cruz de la Sierra, Bolivia"
103,"Ward, Jeremy",Persona,281797334,"Córdoba, Argentina"
104,"Washington, Jack",Persona,490574837,"Río de Janeiro, Brasil"
105,"Washington, Jose",Persona,342142162,"San Juan, Puerto Rico"
106,"Zeng, Omar",Persona,256950849,"San José, Costa Rica"

In [44]:
dfc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 107 entries, 0 to 106
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Cliente    107 non-null    object
 1   Tipo       107 non-null    object
 2   Teléfono   107 non-null    int64
 3   Ubicación  107 non-null    object
dtypes: int64(1), object(3)
memory usage: 3.5+ KB

* Nulos

In [45]:
dfc.isna().sum()

Cliente      0
Tipo         0
Teléfono     0
Ubicación    0
dtype: int64

* Duplicados

In [46]:
dfc.duplicated().sum()

0

In [47]:
dfc.duplicated(subset=['Cliente']).sum()

0

No hay clientes duplicados

## Normalización
De a cuerdo a lo evaluado en las tablas cliente y ventas, se deben realizar las siguientes transformaciones de normalización
* Tabla clientes:
    - Se debe asignar un id único a cada cliente (ya se verificó que son únicos)
    - Se debe crear una tabla tipo de persona con un id unico y reemplazar la columna "Tipo" en la tabla clientes por su correspondiente id
    - Hay que normalizar las localizaciones
* Tabla Ventas:
    - Asignar el id de cada cliente en la tabla ventas y eliminar el campo clientes

### Tipo persona

In [108]:
dfc['Tipo'].value_counts()

Persona    65
Empresa    42
Name: Tipo, dtype: int64

In [57]:
tipos_persona = list(set(dfc['Tipo'].values))

In [62]:
dfp = pd.DataFrame({"IdPersona":[1,2],"Tipo": tipos_persona})

In [63]:
dfp

   IdPersona     Tipo
0          1  Empresa
1          2  Persona

### IdCliente y IdPersona en tabla clientes

In [109]:
dfc = dfc.merge(dfp,on=['Tipo'])

In [110]:
dfc['IdCliente'] = [i for i in range(1,len(dfc)+1)]

In [111]:
dfc = dfc[['IdCliente','Cliente','IdPersona','Teléfono','Ubicación']]

In [112]:
dfc

,IdCliente,Cliente,IdPersona,Teléfono,Ubicación
0,1,"Adams, Fernando",2,373846615,"Miami, Estados Unidos"
1,2,"Adams, Wyatt",2,646775929,"Madrid, España"
2,3,"Alonso, Julio",2,667028591,"Buenos Aires, Argentina"
3,4,"Ana, Maria",2,707344341,"Córdoba, Argentina"
4,5,"Anderson, Nicholas",2,743415512,"La Paz, Bolivia"
...,...,...,...,...,...
102,103,Transportes Pampa,1,397375640,"Asunción, Paraguay"
103,104,Trenton Cnia,1,805211764,"San José, Costa Rica"
104,105,Victoria Cnia,1,694310799,"Maracaibo, Venezuela"
105,106,Viga Ingenieros,1,255869094,"Madrid, España"
106,107,Wapato Cnia,1,501853861,"Santa Cruz de la Sierra, Bolivia"

### Geolocalización - normalización

In [113]:
dfc['Ubicación'].duplicated().sum()

67

In [117]:
dfciudad = dfc[['Ubicación']].drop_duplicates(keep='first').sort_values(by=['Ubicación'])

In [118]:
dfciudad['IdCiudad'] = [i for i in range(1, len(dfciudad)+1)]

In [119]:
dfciudad

                                Ubicación  IdCiudad
60                    Asunción, Paraguay          1
11                     Barcelona, España          2
26                Barranquilla, Colombia          3
41                      Bogotá, Colombia          4
2                Buenos Aires, Argentina          5
10                    Caracas, Venezuela          6
8         Ciudad de Guatemala, Guatemala          7
28              Ciudad de México, México          8
3                     Córdoba, Argentina          9
16                   Guadalajara, México         10
20                    Guayaquil, Ecuador         11
35                       La Habana, Cuba         12
4                        La Paz, Bolivia         13
38                            Lima, Perú         14
37           Los Angeles, Estados Unidos         15
1                         Madrid, España         16
30                    Managua, Nicaragua         17
5                   Maracaibo, Venezuela         18
7                     Medellín, Colombia         19
0                  Miami, Estados Unidos         20
25                     Monterrey, México         21
6                    Montevideo, Uruguay         22
46              New York, Estados Unidos         23
23                        Puebla, México         24
19                        Quito, Ecuador         25
15                Río de Janeiro, Brasil         26
18                  San José, Costa Rica         27
63                 San Juan, Puerto Rico         28
56             San Salvador, El Salvador         29
58      Santa Cruz de la Sierra, Bolivia         30
27            Santiago de Cali, Colombia         31
36                       Santiago, Chile         32
45   Santo Domingo, República Dominicana         33
40                       Sevilla, España         34
39                     São Paulo, Brasil         35
12                 Tegucigalpa, Honduras         36
49                        Toluca, México         37
55                        Trujillo, Perú         38
57                      Valencia, España         39
9                    Valencia, Venezuela         40

* Encuentro latitud y longitud con geocoder

In [94]:
import geocoder
# Funciones de latitud y longitud Geocoder
def find_latitud_geocoder(localizador):
    loc = geocoder.osm(localizador)
    return loc.lat

def find_longitud_geocoder(localizador):
    loc = geocoder.osm(localizador)
    return loc.lng

In [120]:
dfciudad['latitud'] = dfciudad['Ubicación'].map(find_latitud_geocoder)
dfciudad['longitud'] = dfciudad['Ubicación'].map(find_longitud_geocoder)

In [121]:
dfciudad[['Ciudad','País']] = dfciudad['Ubicación'].str.split(', ',expand=True)

In [122]:
dfciudad = dfciudad[['IdCiudad', 'Ciudad', 'País','latitud','longitud','Ubicación']]
dfciudad

,IdCiudad,Ciudad,País,latitud,longitud,Ubicación
60,1,Asunción,Paraguay,-25.280046,-57.634381,"Asunción, Paraguay"
11,2,Barcelona,España,41.382894,2.177432,"Barcelona, España"
26,3,Barranquilla,Colombia,10.993870,-74.792718,"Barranquilla, Colombia"
41,4,Bogotá,Colombia,4.652954,-74.083564,"Bogotá, Colombia"
2,5,Buenos Aires,Argentina,-34.607568,-58.437089,"Buenos Aires, Argentina"
10,6,Caracas,Venezuela,10.506093,-66.914601,"Caracas, Venezuela"
8,7,Ciudad de Guatemala,Guatemala,14.622233,-90.518519,"Ciudad de Guatemala, Guatemala"
28,8,Ciudad de México,México,19.432630,-99.133178,"Ciudad de México, México"
3,9,Córdoba,Argentina,-31.416687,-64.183419,"Córdoba, Argentina"
16,10,Guadalajara,México,20.672037,-103.338396,"Guadalajara, México"
20,11,Guayaquil,Ecuador,-2.190056,-79.886874,"Guayaquil, Ecuador"
35,12,La Habana,Cuba,23.135305,-82.358963,"La Habana, Cuba"
4,13,La Paz,Bolivia,-16.495545,-68.133623,"La Paz, Bolivia"
38,14,Lima,Perú,-12.062107,-77.036526,"Lima, Perú"
37,15,Los Angeles,Estados Unidos,34.053691,-118.242766,"Los Angeles, Estados Unidos"
1,16,Madrid,España,40.416705,-3.703582,"Madrid, España"
30,17,Managua,Nicaragua,12.154404,-86.273764,"Managua, Nicaragua"
5,18,Maracaibo,Venezuela,10.649809,-71.644360,"Maracaibo, Venezuela"
7,19,Medellín,Colombia,6.244338,-75.573553,"Medellín, Colombia"
0,20,Miami,Estados Unidos,25.774173,-80.193620,"Miami, Estados Unidos"
25,21,Monterrey,México,25.680202,-100.315258,"Monterrey, México"
6,22,Montevideo,Uruguay,-34.905892,-56.191310,"Montevideo, Uruguay"
46,23,New York,Estados Unidos,40.712728,-74.006015,"New York, Estados Unidos"
23,24,Puebla,México,18.833333,-98.000000,"Puebla, México"
19,25,Quito,Ecuador,-0.220164,-78.512327,"Quito, Ecuador"
15,26,Río de Janeiro,Brasil,-22.911014,-43.209373,"Río de Janeiro, Brasil"
18,27,San José,Costa Rica,9.932543,-84.079578,"San José, Costa Rica"
63,28,San Juan,Puerto Rico,18.465299,-66.116666,"San Juan, Puerto Rico"
56,29,San Salvador,El Salvador,13.698994,-89.191425,"San Salvador, El Salvador"
58,30,Santa Cruz de la Sierra,Bolivia,-17.783494,-63.182085,"Santa Cruz de la Sierra, Bolivia"
27,31,Santiago de Cali,Colombia,3.452034,-76.532935,"Santiago de Cali, Colombia"
36,32,Santiago,Chile,-33.437776,-70.650450,"Santiago, Chile"
45,33,Santo Domingo,República Dominicana,18.480197,-69.942111,"Santo Domingo, República Dominicana"
40,34,Sevilla,España,37.388630,-5.995340,"Sevilla, España"
39,35,São Paulo,Brasil,-23.550651,-46.633382,"São Paulo, Brasil"
12,36,Tegucigalpa,Honduras,14.105743,-87.204005,"Tegucigalpa, Honduras"
49,37,Toluca,México,19.292545,-99.656901,"Toluca, México"
55,38,Trujillo,Perú,-8.111678,-79.028774,"Trujillo, Perú"
57,39,Valencia,España,39.469707,-0.376335,"Valencia, España"
9,40,Valencia,Venezuela,10.170026,-68.000399,"Valencia, Venezuela"

* Mergeando con tabla clientes

In [123]:
dfc =dfc.merge(dfciudad[['IdCiudad','Ubicación']], on=['Ubicación'], how='left')

In [124]:
dfc.drop(columns=['Ubicación'], inplace=True)
dfc

     IdCliente             Cliente  IdPersona   Teléfono  IdCiudad
0            1     Adams, Fernando          2  373846615        20
1            2        Adams, Wyatt          2  646775929        16
2            3       Alonso, Julio          2  667028591         5
3            4          Ana, Maria          2  707344341         9
4            5  Anderson, Nicholas          2  743415512        13
..         ...                 ...        ...        ...       ...
102        103   Transportes Pampa          1  397375640         1
103        104        Trenton Cnia          1  805211764        27
104        105       Victoria Cnia          1  694310799        18
105        106     Viga Ingenieros          1  255869094        16
106        107         Wapato Cnia          1  501853861        30

[107 rows x 5 columns]

### IdCliente en tabla ventas

In [ ]:
dfv = dfv.merge(dfc[['IdCliente','Cliente']], on=['Cliente'], how='left')

In [78]:
dfv.isna().sum()

NroFactura      0
FechaFactura    0
Cliente         0
MontoSinImp     0
Impuestos       0
MontoFactura    0
IdCliente       0
dtype: int64

In [126]:
dfv

      NroFactura FechaFactura  IdCliente  MontoSinImp  Impuestos  MontoFactura
0              1   2014-01-03        100       765.68     203.53        969.21
1              2   2014-01-03         67       420.60     111.80        532.40
2              3   2014-01-03         77       108.98      28.96        137.94
3              4   2014-01-04         54       304.94      81.05        385.99
4              5   2014-01-04         14       107.07      28.45        135.52
...          ...          ...        ...          ...        ...           ...
4395        4396   2016-07-28         62       113.00      23.73        136.73
4396        4397   2016-07-28         73       409.00      85.89        494.89
4397        4398   2016-07-28         39       801.00     168.21        969.21
4398        4399   2016-07-28         57       856.00     179.76       1035.76
4399        4400   2016-07-29         58       781.00     164.01        945.01

[4400 rows x 6 columns]

In [80]:
dfv = dfv[['NroFactura','FechaFactura','IdCliente','MontoSinImp','Impuestos','MontoFactura']]

In [127]:
dfv

      NroFactura FechaFactura  IdCliente  MontoSinImp  Impuestos  MontoFactura
0              1   2014-01-03        100       765.68     203.53        969.21
1              2   2014-01-03         67       420.60     111.80        532.40
2              3   2014-01-03         77       108.98      28.96        137.94
3              4   2014-01-04         54       304.94      81.05        385.99
4              5   2014-01-04         14       107.07      28.45        135.52
...          ...          ...        ...          ...        ...           ...
4395        4396   2016-07-28         62       113.00      23.73        136.73
4396        4397   2016-07-28         73       409.00      85.89        494.89
4397        4398   2016-07-28         39       801.00     168.21        969.21
4398        4399   2016-07-28         57       856.00     179.76       1035.76
4399        4400   2016-07-29         58       781.00     164.01        945.01

[4400 rows x 6 columns]

## Exportación de data limpia y normalizada

In [131]:
dfv.to_csv('./clean data/Ventas.csv',sep=";",index=False,float_format='%.2f',encoding='utf-8')
dfc.to_csv('./clean data/Clientes.csv',sep=";",index=False,encoding='latin')
dfp.to_csv('./clean data/Personas.csv',index=False,sep=";",encoding='utf-8')
dfciudad.to_csv('./clean data/Ciudad.csv',index=False,sep=";",encoding='latin')